hardfoc/hf-core/handlers/tle92466ed/Tle92466edHandler.cpp
/**
 * @file Tle92466edHandler.cpp
 * @brief Implementation of TLE92466ED handler with SPI communication adapter.
 * @copyright Copyright (c) 2024-2025 HardFOC. All rights reserved.
 */

#include "Tle92466edHandler.h"
#include "Logger.h"
#include "HandlerCommon.h"

static constexpr const char* TAG = "TLE92466ED";

namespace {
/* Fixed TX/RX frame buffers in TU static storage (internal SRAM).
 * Do not stage 32-bit SPI frames on a task stack or external RAM — the MCU
 * SPI path must always see tightly-coupled / internal SRAM pointers. The
 * Comm adapter object itself may still live elsewhere. */
uint8_t g_tle_spi_tx[4]{};
uint8_t g_tle_spi_rx[4]{};

/* Chain staging for pipelined command+dummy bursts. Frame pointers are handed
 * to BaseSpi::TransferChain, which holds ONE bus-ownership window across every
 * frame — see kTleChainGapUs.
 *
 * 16 frames covers the widest sequence the driver builds: a pipelined read of
 * all six channels' FB_DC + FB_I_AVG (12 commands + leading flush + trailing
 * dummy = 14). The previous limit of 4 forced every logical register access to
 * be its own 3-frame chain, so N reads cost 3N frames instead of N+2. */
constexpr size_t kTleChainMaxFrames = 16;
/* Datasheet Rev 1.2 Table 18: tCSN_TD (rising CSN to falling CSN) ≥ 600 ns.
 * 5 µs is ~8× that — enough margin for soft-CS lead lengths on the carrier
 * without paying 20 µs of busy-wait between every frame of a burst. */
constexpr uint32_t kTleChainGapUs = 5U;
uint8_t g_tle_chain_tx[kTleChainMaxFrames][4]{};
uint8_t g_tle_chain_rx[kTleChainMaxFrames][4]{};
}  // namespace

///////////////////////////////////////////////////////////////////////////////
// HalSpiTle92466edComm Implementation
///////////////////////////////////////////////////////////////////////////////

HalSpiTle92466edComm::HalSpiTle92466edComm(
    BaseSpi& spi, BaseGpio& resn, BaseGpio& en,
    BaseGpio* faultn) noexcept
    : spi_(spi), resn_(resn), en_(en), faultn_(faultn) {}

tle92466ed::CommResult<void> HalSpiTle92466edComm::Init() noexcept {
    /* Idempotent: Driver::Init calls Comm::Init on every bring-up retry.
     * Re-parking EN low here toggled the enable rail at the retry rate
     * while ICVID was failing — EN must latch once, then only move for an
     * intentional HW reset (Driver::SetEnable) or safe-off. */
    if (initialized_) {
        last_error_ = tle92466ed::CommError::None;
        return {};
    }

    if (!spi_.EnsureInitialized()) {
        last_error_ = tle92466ed::CommError::HardwareNotReady;
        return tle::unexpected(last_error_);
    }

    /* Pins are batch-programmed by the board GPIO map — only confirm polarity
     * and park levels. Extra SetDirection RMW on a shared I2C expander bus
     * has wedged the expander after map bring-up. First Init only: park EN
     * low / RESN released; Driver::Init then owns the reset+enable sequence. */
    resn_.SetActiveState(hf_gpio_active_state_t::HF_GPIO_ACTIVE_LOW);
    if (!resn_.EnsureInitialized() ||
        resn_.SetInactive() != hf_gpio_err_t::GPIO_SUCCESS) {
        last_error_ = tle92466ed::CommError::HardwareNotReady;
        return tle::unexpected(last_error_);
    }

    en_.SetActiveState(hf_gpio_active_state_t::HF_GPIO_ACTIVE_HIGH);
    if (!en_.EnsureInitialized() ||
        en_.SetInactive() != hf_gpio_err_t::GPIO_SUCCESS) {
        last_error_ = tle92466ed::CommError::HardwareNotReady;
        return tle::unexpected(last_error_);
    }

    if (faultn_) {
        faultn_->SetActiveState(hf_gpio_active_state_t::HF_GPIO_ACTIVE_LOW);
        if (!faultn_->EnsureInitialized()) {
            last_error_ = tle92466ed::CommError::HardwareNotReady;
            return tle::unexpected(last_error_);
        }
    }

    initialized_ = true;
    last_error_ = tle92466ed::CommError::None;
    return {};
}

tle92466ed::CommResult<void> HalSpiTle92466edComm::Deinit() noexcept {
    /* Comm deinit is a flag only — Driver::Deinit owns safe-off sequencing. */
    initialized_ = false;
    return {};
}

tle92466ed::CommResult<uint32_t> HalSpiTle92466edComm::Transfer32(uint32_t tx_data) noexcept {
    if (!initialized_) {
        last_error_ = tle92466ed::CommError::HardwareNotReady;
        return tle::unexpected(last_error_);
    }
    /* MSB-first on the wire (matches byte_swap + LE DMA staging). Uses TU-static
     * internal SRAM buffers — not stack or external RAM (see g_tle_spi_tx). */
    g_tle_spi_tx[0] = static_cast<uint8_t>((tx_data >> 24) & 0xFF);
    g_tle_spi_tx[1] = static_cast<uint8_t>((tx_data >> 16) & 0xFF);
    g_tle_spi_tx[2] = static_cast<uint8_t>((tx_data >> 8) & 0xFF);
    g_tle_spi_tx[3] = static_cast<uint8_t>((tx_data >> 0) & 0xFF);
    g_tle_spi_rx[0] = g_tle_spi_rx[1] = g_tle_spi_rx[2] = g_tle_spi_rx[3] = 0;

    auto err = spi_.Transfer(g_tle_spi_tx, g_tle_spi_rx, hf_u16_t{4}, hf_u32_t{0});
    if (err != hf_spi_err_t::SPI_SUCCESS) {
        Logger::GetInstance().Error(TAG,
            "Transfer32: SPI Transfer failed (err=%d) tx=%02X %02X %02X %02X",
            static_cast<int>(err), g_tle_spi_tx[0], g_tle_spi_tx[1],
            g_tle_spi_tx[2], g_tle_spi_tx[3]);
        last_error_ = tle92466ed::CommError::TransferError;
        return tle::unexpected(last_error_);
    }

    const uint32_t rx_data =
        (static_cast<uint32_t>(g_tle_spi_rx[0]) << 24) |
        (static_cast<uint32_t>(g_tle_spi_rx[1]) << 16) |
        (static_cast<uint32_t>(g_tle_spi_rx[2]) << 8) |
        (static_cast<uint32_t>(g_tle_spi_rx[3]) << 0);
    last_rx_ = rx_data;
    /* Inter-frame gap between CS cycles (TLE two-transfer read protocol) —
     * datasheet tCSN_TD, see kTleChainGapUs. */
    handler_utils::DelayUs(kTleChainGapUs);
    last_error_ = tle92466ed::CommError::None;
    return rx_data;
}

tle92466ed::CommResult<void> HalSpiTle92466edComm::TransferMulti(
    std::span<const uint32_t> tx_data,
    std::span<uint32_t> rx_data) noexcept {
    return TransferMulti(tx_data, rx_data, 0U);
}

tle92466ed::CommResult<void> HalSpiTle92466edComm::TransferMulti(
    std::span<const uint32_t> tx_data,
    std::span<uint32_t> rx_data,
    uint32_t gap_us) noexcept {
    if (gap_us == 0U) {
        gap_us = kTleChainGapUs;
    }
    if (!initialized_) {
        last_error_ = tle92466ed::CommError::HardwareNotReady;
        return tle::unexpected(last_error_);
    }
    if (tx_data.size() != rx_data.size() || tx_data.empty()) {
        last_error_ = tle92466ed::CommError::InvalidParameter;
        return tle::unexpected(last_error_);
    }

    /* The TLE92466ED reply pipeline spans two CS windows: the response to the
     * command frame only appears on the NEXT frame. Issuing those frames as
     * independent BaseSpi::Transfer calls releases the SPI2 bus mutex between
     * them, so a peer transaction can consume this device's pipeline slot —
     * observed as "sticky-zero" register reads and impossible FB_I_AVG ratios
     * (TP_MANT spliced from another frame). TransferChain keeps ONE bus
     * ownership window across the whole pipeline while still raising CS
     * between frames, which is what the protocol requires. */
    if (tx_data.size() <= kTleChainMaxFrames) {
        const size_t n = tx_data.size();
        const uint8_t* tx_ptrs[kTleChainMaxFrames]{};
        uint8_t* rx_ptrs[kTleChainMaxFrames]{};
        for (size_t i = 0; i < n; ++i) {
            g_tle_chain_tx[i][0] = static_cast<uint8_t>((tx_data[i] >> 24) & 0xFF);
            g_tle_chain_tx[i][1] = static_cast<uint8_t>((tx_data[i] >> 16) & 0xFF);
            g_tle_chain_tx[i][2] = static_cast<uint8_t>((tx_data[i] >> 8) & 0xFF);
            g_tle_chain_tx[i][3] = static_cast<uint8_t>((tx_data[i] >> 0) & 0xFF);
            g_tle_chain_rx[i][0] = g_tle_chain_rx[i][1] = 0;
            g_tle_chain_rx[i][2] = g_tle_chain_rx[i][3] = 0;
            tx_ptrs[i] = g_tle_chain_tx[i];
            rx_ptrs[i] = g_tle_chain_rx[i];
        }

        const auto err = spi_.TransferChain(tx_ptrs, rx_ptrs, hf_u16_t{4},
                                            static_cast<hf_u16_t>(n),
                                            hf_u32_t{gap_us},
                                            hf_u32_t{0});
        if (err != hf_spi_err_t::SPI_SUCCESS) {
            Logger::GetInstance().Error(
                TAG, "TransferMulti: TransferChain failed (err=%d, frames=%u)",
                static_cast<int>(err), static_cast<unsigned>(n));
            last_error_ = tle92466ed::CommError::TransferError;
            return tle::unexpected(last_error_);
        }

        for (size_t i = 0; i < n; ++i) {
            rx_data[i] = (static_cast<uint32_t>(g_tle_chain_rx[i][0]) << 24) |
                         (static_cast<uint32_t>(g_tle_chain_rx[i][1]) << 16) |
                         (static_cast<uint32_t>(g_tle_chain_rx[i][2]) << 8) |
                         (static_cast<uint32_t>(g_tle_chain_rx[i][3]) << 0);
        }
        last_rx_ = rx_data[n - 1];
        last_rx_first_ = rx_data[0];
        last_error_ = tle92466ed::CommError::None;
        return {};
    }

    /* Longer bursts are not part of any TLE protocol sequence; fall back to
     * per-frame transfers rather than silently truncating the chain. */
    for (size_t i = 0; i < tx_data.size(); ++i) {
        auto result = Transfer32(tx_data[i]);
        if (!result) {
            return tle::unexpected(result.error());
        }
        rx_data[i] = *result;
    }
    return {};
}

tle92466ed::CommResult<void> HalSpiTle92466edComm::Delay(uint32_t microseconds) noexcept {
    handler_utils::DelayUs(microseconds);
    return {};
}

