hardfoc/hf-core/handlers/tle92466ed/Tle92466edHandler.cpp
tle92466ed::CommResult<void> HalSpiTle92466edComm::Configure(
    const tle92466ed::SPIConfig& /*config*/) noexcept {
    /* Board bind configures SPI2 Mode 1 / 32-bit before this adapter exists. */
    return {};
}

bool HalSpiTle92466edComm::IsReady() const noexcept {
    return initialized_;
}

tle92466ed::CommError HalSpiTle92466edComm::GetLastError() const noexcept {
    return last_error_;
}

tle92466ed::CommResult<void> HalSpiTle92466edComm::ClearErrors() noexcept {
    last_error_ = tle92466ed::CommError::None;
    return {};
}

tle92466ed::CommResult<void> HalSpiTle92466edComm::GpioSet(
    tle92466ed::CtrlPin pin, tle92466ed::GpioSignal signal) noexcept {
    if (!initialized_) {
        last_error_ = tle92466ed::CommError::HardwareNotReady;
        return tle::unexpected(last_error_);
    }

    BaseGpio* gpio = nullptr;

    switch (pin) {
        case tle92466ed::CtrlPin::RESN:   gpio = &resn_;   break;
        case tle92466ed::CtrlPin::EN:     gpio = &en_;     break;
        case tle92466ed::CtrlPin::FAULTN: gpio = faultn_;  break;
        default:
            last_error_ = tle92466ed::CommError::InvalidParameter;
            return tle::unexpected(last_error_);
    }

    if (gpio == nullptr) {
        last_error_ = tle92466ed::CommError::InvalidParameter;
        return tle::unexpected(last_error_);
    }

    // BaseGpio active level is configured per-pin — map driver ACTIVE/INACTIVE
    // to SetActive/SetInactive rather than raw pin writes.
    hf_gpio_err_t gpio_err = hf_gpio_err_t::GPIO_SUCCESS;
    if (signal == tle92466ed::GpioSignal::ACTIVE) {
        gpio_err = gpio->SetActive();
    } else {
        gpio_err = gpio->SetInactive();
    }

    if (gpio_err != hf_gpio_err_t::GPIO_SUCCESS) {
        last_error_ = tle92466ed::CommError::BusError;
        return tle::unexpected(last_error_);
    }

    last_error_ = tle92466ed::CommError::None;
    return {};
}

tle92466ed::CommResult<tle92466ed::GpioSignal> HalSpiTle92466edComm::GpioRead(
    tle92466ed::CtrlPin pin) noexcept {
    if (!initialized_) {
        last_error_ = tle92466ed::CommError::HardwareNotReady;
        return tle::unexpected(last_error_);
    }

    BaseGpio* gpio = nullptr;

    switch (pin) {
        case tle92466ed::CtrlPin::RESN:   gpio = &resn_;   break;
        case tle92466ed::CtrlPin::EN:     gpio = &en_;     break;
        case tle92466ed::CtrlPin::FAULTN: gpio = faultn_;  break;
        default:
            last_error_ = tle92466ed::CommError::InvalidParameter;
            return tle::unexpected(last_error_);
    }

    if (gpio == nullptr) {
        last_error_ = tle92466ed::CommError::InvalidParameter;
        return tle::unexpected(last_error_);
    }

    bool is_active = false;
    auto err = gpio->IsActive(is_active);
    if (err != hf_gpio_err_t::GPIO_SUCCESS) {
        last_error_ = tle92466ed::CommError::BusError;
        return tle::unexpected(last_error_);
    }

    last_error_ = tle92466ed::CommError::None;
    return is_active ? tle92466ed::GpioSignal::ACTIVE
                     : tle92466ed::GpioSignal::INACTIVE;
}

void HalSpiTle92466edComm::Log(tle92466ed::LogLevel level, const char* tag,
                                 const char* format, va_list args) noexcept {
    handler_utils::RouteLogToLogger(static_cast<int>(level), tag, format, args);
}

///////////////////////////////////////////////////////////////////////////////
// Helper: convert uint8_t channel to tle92466ed::Channel enum
///////////////////////////////////////////////////////////////////////////////

static inline tle92466ed::Channel toChannel(uint8_t ch) {
    /* Bounds are validated by every public handler entrypoint before call. */
    return static_cast<tle92466ed::Channel>(ch);
}

///////////////////////////////////////////////////////////////////////////////
// Tle92466edHandler Implementation
///////////////////////////////////////////////////////////////////////////////

Tle92466edHandler::Tle92466edHandler(
    BaseSpi& spi, BaseGpio& resn, BaseGpio& en,
    BaseGpio* faultn) noexcept {
    comm_ = std::make_unique<HalSpiTle92466edComm>(spi, resn, en, faultn);
    Logger::GetInstance().Info(TAG, "TLE92466ED handler created");
}

Tle92466edHandler::~Tle92466edHandler() noexcept {
    /* Best-effort safe-off; do not throw from destructor. */
    if (initialized_) {
        Deinitialize();
    }
}

tle92466ed::DriverResult<void> Tle92466edHandler::Initialize(
    bool perform_hardware_reset) noexcept {
    MutexLockGuard lock(mutex_);
    return InitializeLocked(perform_hardware_reset);
}

tle92466ed::DriverResult<void> Tle92466edHandler::InitializeLocked(
    bool perform_hardware_reset) noexcept {
    /* Caller holds mutex_. Comm::Init is idempotent; Driver::Init owns RESN/EN
     * sequencing and the first ICVID read after optional hardware reset. */
    if (initialized_) {
        Logger::GetInstance().Warn(TAG, "Already initialized");
        return {};
    }
    if (!comm_) {
        Logger::GetInstance().Error(TAG, "Comm adapter not created");
        return tle::unexpected(tle92466ed::DriverError::NotInitialized);
    }

    driver_ = std::make_unique<DriverType>(*comm_);
    auto result = driver_->Init(perform_hardware_reset);
    if (!result) {
        Logger::GetInstance().Error(TAG, "Driver init failed: %d",
                                   static_cast<int>(result.error()));
        driver_.reset();
        return tle::unexpected(result.error());
    }

    initialized_ = true;
    Logger::GetInstance().Info(TAG, "TLE92466ED initialized successfully");
    return {};
}

bool Tle92466edHandler::EnsureInitialized() noexcept {
    MutexLockGuard lock(mutex_);
    return EnsureInitializedLocked();
}

tle92466ed::DriverResult<void> Tle92466edHandler::Initialize(const tle92466ed::GlobalConfig& config) noexcept {
    MutexLockGuard lock(mutex_);
    if (initialized_) {
        Logger::GetInstance().Warn(TAG, "Already initialized");
        return {};
    }
    if (!comm_) {
        Logger::GetInstance().Error(TAG, "Comm adapter not created");
        return tle::unexpected(tle92466ed::DriverError::NotInitialized);
    }

    driver_ = std::make_unique<DriverType>(*comm_);

