hardfoc/hf-core/handlers/tle92466ed/Tle92466edHandler.cpp
    /* Init() always hardware-resets; GlobalConfig overload has no reset flag. */
    auto result = driver_->Init();
    if (!result) {
        Logger::GetInstance().Error(TAG, "Driver init failed: %d",
                                   static_cast<int>(result.error()));
        driver_.reset();
        return tle::unexpected(result.error());
    }

    auto cfg_result = driver_->ConfigureGlobal(config);
    if (!cfg_result) {
        Logger::GetInstance().Error(TAG, "Global config failed: %d",
                                   static_cast<int>(cfg_result.error()));
        driver_.reset();
        return tle::unexpected(cfg_result.error());
    }

    initialized_ = true;
    Logger::GetInstance().Info(TAG, "TLE92466ED initialized with config");
    return {};
}

bool Tle92466edHandler::EnsureInitializedLocked() noexcept {
    /* Lazy path always hardware-resets so first consumer sees a known device. */
    if (initialized_ && driver_) {
        return true;
    }
    if (!comm_) {
        Logger::GetInstance().Error(TAG, "Comm adapter not created");
        return false;
    }
    return InitializeLocked(/*perform_hardware_reset=*/true).has_value();
}

tle92466ed::DriverResult<void> Tle92466edHandler::Deinitialize() noexcept {
    MutexLockGuard lock(mutex_);
    if (!initialized_) return {};

    if (driver_) {
        /* Drop channel enables before destroying driver_; does not pulse RESN. */
        (void)driver_->DisableAllChannels();
    }
    driver_.reset();
    initialized_ = false;
    Logger::GetInstance().Info(TAG, "TLE92466ED deinitialized");
    return {};
}

tle92466ed::DriverResult<void> Tle92466edHandler::ConfigureChannel(uint8_t channel,
                                          const tle92466ed::ChannelConfig& config) noexcept {
    return withDriver([&](auto& drv) -> tle92466ed::DriverResult<void> {
        if (channel >= kNumChannels)
            return tle::unexpected(tle92466ed::DriverError::InvalidChannel);
        return drv.ConfigureChannel(toChannel(channel), config);
    });
}

tle92466ed::DriverResult<void> Tle92466edHandler::EnableChannel(uint8_t channel) noexcept {
    return withDriver([&](auto& drv) -> tle92466ed::DriverResult<void> {
        if (channel >= kNumChannels)
            return tle::unexpected(tle92466ed::DriverError::InvalidChannel);
        return drv.EnableChannel(toChannel(channel), true);
    });
}

tle92466ed::DriverResult<void> Tle92466edHandler::DisableChannel(uint8_t channel) noexcept {
    return withDriver([&](auto& drv) -> tle92466ed::DriverResult<void> {
        if (channel >= kNumChannels)
            return tle::unexpected(tle92466ed::DriverError::InvalidChannel);
        return drv.EnableChannel(toChannel(channel), false);
    });
}

tle92466ed::DriverResult<void> Tle92466edHandler::EnableAllChannels() noexcept {
    return withDriver([](auto& drv) -> tle92466ed::DriverResult<void> {
        return drv.EnableAllChannels();
    });
}

tle92466ed::DriverResult<void> Tle92466edHandler::DisableAllChannels() noexcept {
    return withDriver([](auto& drv) -> tle92466ed::DriverResult<void> {
        return drv.DisableAllChannels();
    });
}

tle92466ed::DriverResult<void> Tle92466edHandler::SetChannelCurrent(uint8_t channel, uint16_t current_ma) noexcept {
    return withDriver([&](auto& drv) -> tle92466ed::DriverResult<void> {
        if (channel >= kNumChannels)
            return tle::unexpected(tle92466ed::DriverError::InvalidChannel);
        return drv.SetCurrentSetpoint(toChannel(channel), current_ma);
    });
}

tle92466ed::DriverResult<void> Tle92466edHandler::SetChannelCurrentUa(uint8_t channel, uint32_t current_ua) noexcept {
    return withDriver([&](auto& drv) -> tle92466ed::DriverResult<void> {
        if (channel >= kNumChannels)
            return tle::unexpected(tle92466ed::DriverError::InvalidChannel);
        return drv.SetCurrentSetpointUa(toChannel(channel), current_ua);
    });
}

tle92466ed::DriverResult<uint16_t> Tle92466edHandler::GetChannelCurrentSetpoint(
    uint8_t channel, bool parallel_mode) noexcept {
    return withDriver([&](auto& drv) -> tle92466ed::DriverResult<uint16_t> {
        if (channel >= kNumChannels)
            return tle::unexpected(tle92466ed::DriverError::InvalidChannel);
        return drv.GetCurrentSetpoint(toChannel(channel), parallel_mode);
    });
}

tle92466ed::DriverResult<void> Tle92466edHandler::ConfigurePwmRaw(uint8_t channel, uint8_t mantissa,
                                         uint8_t exponent, bool low_freq_range) noexcept {
    return withDriver([&](auto& drv) -> tle92466ed::DriverResult<void> {
        if (channel >= kNumChannels)
            return tle::unexpected(tle92466ed::DriverError::InvalidChannel);
        return drv.ConfigurePwmPeriodRaw(toChannel(channel), mantissa,
                                          exponent, low_freq_range);
    });
}

tle92466ed::DriverResult<void> Tle92466edHandler::EnterMissionMode() noexcept {
    return withDriver([](auto& drv) -> tle92466ed::DriverResult<void> {
        return drv.EnterMissionMode();
    });
}

tle92466ed::DriverResult<void> Tle92466edHandler::EnableOutputStage() noexcept {
    return withDriver([](auto& drv) -> tle92466ed::DriverResult<void> {
        return drv.Enable();
    });
}

tle92466ed::DriverResult<void> Tle92466edHandler::DisableOutputStage() noexcept {
    return withDriver([](auto& drv) -> tle92466ed::DriverResult<void> {
        return drv.Disable();
    });
}

tle92466ed::DriverResult<void> Tle92466edHandler::EnableFeedbackUpdates() noexcept {
    return withDriver([](auto& drv) -> tle92466ed::DriverResult<void> {
        /* Driver owns FB_FRZ. A leftover freeze stops Tmeas for that channel. */
        return drv.ReleaseFeedbackFreeze();
    });
}

tle92466ed::DriverResult<void> Tle92466edHandler::EnterConfigMode() noexcept {
    return withDriver([](auto& drv) -> tle92466ed::DriverResult<void> {
        return drv.EnterConfigMode();
    });
}

bool Tle92466edHandler::IsMissionMode() noexcept {
    return withDriver([](auto& drv) -> bool {
        return drv.IsMissionMode();
    });
}

tle92466ed::DriverResult<void> Tle92466edHandler::GetStatus(tle92466ed::DeviceStatus& status) noexcept {
    return withDriver([&](auto& drv) -> tle92466ed::DriverResult<void> {
        auto result = drv.GetDeviceStatus();
        if (!result) return tle::unexpected(result.error());
        status = *result;
        return {};
    });
}

tle92466ed::DriverResult<void> Tle92466edHandler::GetChannelDiagnostics(uint8_t channel,
                                               tle92466ed::ChannelDiagnostics& diag) noexcept {
    return withDriver([&](auto& drv) -> tle92466ed::DriverResult<void> {
        if (channel >= kNumChannels)
            return tle::unexpected(tle92466ed::DriverError::InvalidChannel);
        auto result = drv.GetChannelDiagnostics(toChannel(channel));
        if (!result) return tle::unexpected(result.error());
        diag = *result;
        return {};
    });
}

tle92466ed::DriverResult<void> Tle92466edHandler::GetFaultReport(tle92466ed::FaultReport& report) noexcept {
    return withDriver([&](auto& drv) -> tle92466ed::DriverResult<void> {
        auto result = drv.GetAllFaults();
        if (!result) return tle::unexpected(result.error());
        report = *result;
        return {};
    });
}

tle92466ed::DriverResult<void> Tle92466edHandler::ClearFaults() noexcept {
    return withDriver([](auto& drv) -> tle92466ed::DriverResult<void> {
        return drv.ClearFaults();
    });
}

bool Tle92466edHandler::HasFault() noexcept {
    return withDriver([](auto& drv) -> bool {
        auto result = drv.HasAnyFault();
        if (!result) return false;
        return *result;
    });
}

tle92466ed::DriverResult<void> Tle92466edHandler::KickWatchdog(uint16_t reload_value) noexcept {
    return withDriver([&](auto& drv) -> tle92466ed::DriverResult<void> {
        return drv.ReloadSpiWatchdog(reload_value);
    });
}

uint32_t Tle92466edHandler::GetChipId() noexcept {
    return withDriver([](auto& drv) -> uint32_t {
        auto result = drv.GetChipId();
        if (!result) return 0;
        auto& arr = *result;
        return (static_cast<uint32_t>(arr[1]) << 16) | static_cast<uint32_t>(arr[0]);
    });
}

uint32_t Tle92466edHandler::GetIcVersion() noexcept {
    return withDriver([](auto& drv) -> uint32_t {
        auto result = drv.GetIcVersion();
        if (!result) return 0;
        return static_cast<uint32_t>(*result);
    });
}

