hardfoc/hf-core/handlers/tle92466ed/Tle92466edHandler.cpp
Tle92466edHandler::DriverType* Tle92466edHandler::GetDriver() noexcept {
    MutexLockGuard lock(mutex_);
    /* Never HW-reset from GetDriver — upper layers own RESN policy. Callers
     * that need init must go through Initialize() / EnsureInitialized(). */
    if (!initialized_ || !driver_) {
        return nullptr;
    }
    return driver_.get();
}

const Tle92466edHandler::DriverType* Tle92466edHandler::GetDriver() const noexcept {
    /* Delegate to non-const impl: lazy init is intentionally unavailable here. */
    auto* self = const_cast<Tle92466edHandler*>(this);
    return self->GetDriver();
}

void Tle92466edHandler::DumpDiagnostics() noexcept {
    MutexLockGuard lock(mutex_);
    auto& log = Logger::GetInstance();
    if (!EnsureInitializedLocked() || !driver_) {
        log.Warn(TAG, "Not initialized — cannot dump diagnostics");
        return;
    }

    log.Info(TAG, "=== TLE92466ED Diagnostics ===");

    // Device status
    auto status_result = driver_->GetDeviceStatus();
    if (status_result) {
        auto& s = *status_result;
        log.Info(TAG, "  Config mode: %s", s.config_mode ? "yes" : "no");
        log.Info(TAG, "  Init done: %s", s.init_done ? "yes" : "no");
        log.Info(TAG, "  Any fault: %s", s.any_fault ? "YES" : "no");
        log.Info(TAG, "  OT warning: %s", s.ot_warning ? "YES" : "no");
        log.Info(TAG, "  OT error: %s", s.ot_error ? "YES" : "no");
        log.Info(TAG, "  VBAT: %u mV", s.vbat_voltage);
        log.Info(TAG, "  VIO: %u mV", s.vio_voltage);
    }

    // Per-channel diagnostics
    for (uint8_t ch = 0; ch < kNumChannels; ++ch) {
        auto diag_result = driver_->GetChannelDiagnostics(toChannel(ch));
        if (diag_result) {
            auto& d = *diag_result;
            log.Info(TAG,
                     "  CH%u: OC=%s SG=%s OL=%s OTE=%s AvgI=%u DC=%u Imin=%d Imax=%d OTW=%s I_REG=%s",
                     ch,
                     d.overcurrent ? "Y" : "n",
                     d.short_to_ground ? "Y" : "n",
                     d.open_load ? "Y" : "n",
                     d.over_temperature ? "Y" : "n",
                     static_cast<unsigned>(d.average_current),
                     static_cast<unsigned>(d.duty_cycle),
                     static_cast<int>(d.min_current_mA),
                     static_cast<int>(d.max_current_mA),
                     d.ot_warning ? "Y" : "n",
                     d.current_regulation_warning ? "Y" : "n");
        }
    }

    // Chip ID
    auto id_result = driver_->GetChipId();
    if (id_result) {
        auto& arr = *id_result;
        uint32_t combined = (static_cast<uint32_t>(arr[1]) << 16) | static_cast<uint32_t>(arr[0]);
        log.Info(TAG, "  Chip ID: 0x%04X 0x%04X 0x%04X (combined 0x%08lX)",
                 arr[0], arr[1], arr[2], static_cast<unsigned long>(combined));
    }

    log.Info(TAG, "=== End TLE92466ED Diagnostics ===");
}
